// export default {
//   'POST /api/diagnose/v1/findfinancials': {
//     code: 1,
//     state: 200,
//     records: {
//       // 基金区间持仓总数
//       totalFundRangePosition: '10',
//       // 基金区间收益
//       fundRangeIncome: '-109.87',
//       // 基金期末市值
//       fundEndingMarketValue: '234523.23',
//       // 基金持仓列表
//       fundPositionList: [
//         {
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '兴全趋势(LOF)',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002550',
//           // 产品名称
//           name: '易方达消费行业股票',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '873.34',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '中欧新蓝筹混合A',
//           // 清仓标志
//           hasSoldOut: '0',
//           // 收益
//           income: '',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '鹏华沪深300指数',
//           // 清仓标志
//           hasSoldOut: '0',
//           // 收益
//           income: '3753.33',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '天弘沪深300指数A',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '-8955.33',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '民生加银家盈理财7天债券A',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '6793.68',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '600071',
//           // 产品名称
//           name: '广发理财30天',
//           // 清仓标志
//           hasSoldOut: '0',
//           // 收益
//           income: '-6793.68',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '兴全趋势(LOF)',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '6793.68',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002550',
//           // 产品名称
//           name: '易方达消费行业股票',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '873.34',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '中欧新蓝筹混合A',
//           // 清仓标志
//           hasSoldOut: '0',
//           // 收益
//           income: '-6793.68',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '鹏华沪深300指数',
//           // 清仓标志
//           hasSoldOut: '0',
//           // 收益
//           income: '3753.33',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '天弘沪深300指数A',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '-8955.33',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '民生加银家盈理财7天债券A',
//           // 清仓标志
//           hasSoldOut: '1',
//           // 收益
//           income: '6793.68',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '600071',
//           // 产品名称
//           name: '广发理财30天',
//           // 清仓标志
//           hasSoldOut: '0',
//           // 收益
//           income: '-6793.68',
//           // 产品内码
//           secuIntl: '000000',
//         },
//       ],
//       lcPosiNum: '10',
//       lcFinalPlAmt: '892.43',
//       lcFinaMktVal: '34523.54',
//       lcPosiList: [
//         {
//           // 产品代码
//           code: '002255',
//           // 产品名称
//           name: '新手理财001',
//           // 产品收益
//           income: '7999.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '001155',
//           // 产品名称
//           name: '万利宝18年26期C款',
//           // 产品收益
//           income: '-7999.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002355',
//           // 产品名称
//           name: '安信理财1号',
//           // 产品收益
//           income: '799.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002655',
//           // 产品名称
//           name: '安信尊享价值',
//           // 产品收益
//           income: '-79.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002255',
//           // 产品名称
//           name: '新手理财001',
//           // 产品收益
//           income: '7999.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '001155',
//           // 产品名称
//           name: '万利宝18年26期C款',
//           // 产品收益
//           income: '-7999.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002355',
//           // 产品名称
//           name: '安信理财1号',
//           // 产品收益
//           income: '799.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//         {
//           // 产品代码
//           code: '002655',
//           // 产品名称
//           name: '安信尊享价值',
//           // 产品收益
//           income: '-79.05',
//           // 产品内码
//           secuIntl: '000000',
//         },
//       ],
//     },
//   },
// };