// export default {
//   'POST /api/diagnose/v1/findHomePage': {
//     code: 1,
//     records: {
//       // 用户唯一标识，用于前端区分用户，但是不关心用户的身份信息
//       id: '',
//       beginDate: '20180601',
//       endDate: '20180623',
//       hasBill: '',
//       billDate: '',
//       // 收益总揽
//       incomeOverview: {
//         // 区间总收益
//         rangeTotalIncome: '765923240.00',
//         // 区间现金收益
//         rangeCashIncome: '890',
//         // 区间股票收益(回报)
//         rangeStockReturns: '-67885.22',
//         // 区间理财收益
//         rangeFinancialIncome: '-12898790.98',
//         // 区间国债逆回购收益
//         rangeDebtReverseRepurchaseIncome: '12007622.73',
//       },
//       incomeDetail: [
//         {
//           date: '20200817',
//           income: '217.84',
//         },
//         {
//           date: '20200818',
//           income: null,
//         },
//         {
//           date: '20200819',
//           income: '-18.75',
//         },
//         {
//           date: '20200820',
//           income: '98.64',
//         },
//         {
//           date: '20200821',
//           income: '',
//         },
//         {
//           date: '20200824',
//           income: '20.21',
//         },
//         {
//           date: '20200825',
//           income: '-36.21',
//         },
//         {
//           date: '20200826',
//           income: '22.71',
//         },
//         {
//           date: '20200827',
//           income: '156.48',
//         },
//         {
//           date: '20200828',
//           income: '16.21',
//         },
//         {
//           date: '20200829',
//           income: '-6.21',
//         },
//         {
//           date: '20200830',
//           income: '-8.21',
//         },
//         {
//           date: '20200901',
//           income: '56.21',
//         },
//         {
//           date: '20200902',
//           income: '26.21',
//         },
//         {
//           date: '20200903',
//           income: '-6.21',
//         },
//         {
//           date: '20200904',
//           income: '8.21',
//         },
//       ],
//       // 收益走势
//       incomeTrend: {
//         // 我的收益率
//         myRateOfReturn: '1.23',
//         // 沪深300比率
//         hs300Ratio: '-0.30',
//         // 上证比率 SSE 是专有名词缩写
//         sseRatio: '',
//         // 创业板比率 GEM
//         gemRatio: '',
//         // 我的每日收益率列表
//         myIncomeRateList: [
//           {
//             incomeRate: '0.74',
//             date: '20180601',
//           },
//           {
//             incomeRate: '1.89',
//             date: '20180604',
//           },
//           {
//             incomeRate: '1.45',
//             date: '20180605',
//           },
//           {
//             incomeRate: '0.82',
//             date: '20180606',
//           },
//           {
//             incomeRate: '-2.49',
//             date: '20180607',
//           },
//           {
//             incomeRate: '-2.73',
//             date: '20180608',
//           },
//           {
//             incomeRate: '1.60',
//             date: '20180611',
//           },
//           {
//             incomeRate: '0.96',
//             date: '20180612',
//           },
//         ],
//         // 每日沪深300指数涨跌比率列表
//         hs300RateList: [
//           {
//             incomeRate: '3.74',
//             date: '20180601',
//           },
//           {
//             incomeRate: '1.89',
//             date: '20180604',
//           },
//           {
//             incomeRate: '1.45',
//             date: '20180605',
//           },
//           {
//             incomeRate: '0.82',
//             date: '20180606',
//           },
//           {
//             incomeRate: '0.49',
//             date: '20180607',
//           },
//           {
//             incomeRate: '1.73',
//             date: '20180608',
//           },
//           {
//             incomeRate: '0.60',
//             date: '20180611',
//           },
//           {
//             incomeRate: '0.96',
//             date: '20180612',
//           },
//         ],
//         // 每日上证指数涨跌比率列表
//         sseRateList: [
//           {
//             incomeRate: '1.63',
//             date: '20180601',
//           },
//           {
//             incomeRate: '0.89',
//             date: '20180604',
//           },
//           {
//             incomeRate: '1.45',
//             date: '20180605',
//           },
//           {
//             incomeRate: '2.82',
//             date: '20180606',
//           },
//           {
//             incomeRate: '-2.49',
//             date: '20180607',
//           },
//           {
//             incomeRate: '-3.73',
//             date: '20180608',
//           },
//           {
//             incomeRate: '1.60',
//             date: '20180611',
//           },
//           {
//             incomeRate: '0.96',
//             date: '20180612',
//           },
//         ],
//         // 每日创业板指数涨跌比率列表
//         gemRateList: [
//           {
//             incomeRate: '5.74',
//             date: '20180601',
//           },
//           {
//             incomeRate: '1.89',
//             date: '20180604',
//           },
//           {
//             incomeRate: '1.45',
//             date: '20180605',
//           },
//           {
//             incomeRate: '0.82',
//             date: '20180606',
//           },
//           {
//             incomeRate: '0.49',
//             date: '20180607',
//           },
//           {
//             incomeRate: '3.73',
//             date: '20180608',
//           },
//           {
//             incomeRate: '1.60',
//             date: '20180611',
//           },
//           {
//             incomeRate: '1.96',
//             date: '20180612',
//           },
//         ],
//       },
//       // 收益排名
//       revenueRanking: {
//         // 我的排名比例
//         myRatio: '100',
//         // 亏损账户比例
//         lossRatio: '45',
//         // 盈利账户比例
//         profitRatio: '55',
//         //0收益
//         zeroRate: '0',
//       },
//       // 总资产变动
//       totalAssetChanges: {
//         // 银证转入
//         transferIn: '7890.20',
//         // 银证转出
//         transferOut: '-765923240.00',
//         // 净转入
//         netTransfer: '1234399.68',
//         // 期初资产
//         initialAsset: '2340340.20',
//         // 期末资产
//         finalAsset: '723240.00',
//         // 账户盈亏
//         profit: '1234399.68',
//         // 资产收益列表 (用于绘制走势图)
//         assetProfitList: [
//           {
//             // 日期
//             date: '20180101',
//             // 资产
//             asset: '1340330.0',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180102',
//             // 资产
//             asset: '1220330.9',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180103',
//             // 资产
//             asset: '1340930.34',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180104',
//             // 资产
//             asset: '2160000.4',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180105',
//             // 资产
//             asset: '1100330.5',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180106',
//             // 资产
//             asset: '1760000.0',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180107',
//             // 资产
//             asset: '1350000.6',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180108',
//             // 资产
//             asset: '1480000.5',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180109',
//             // 资产
//             asset: '2160000.4',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180110',
//             // 资产
//             asset: '190000.1',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//           {
//             // 日期
//             date: '20180111',
//             // 资产
//             asset: '950000.6',
//             // 收益 (待定，前端未使用)
//             profit: '',
//             // 收益率  (待定，前端未使用)
//             profitRate: '',
//           },
//         ],
//       },
//       // 持仓股票分析
//       positionStockAnalysis: {
//         // 持仓总数
//         holdNumber: '7',
//         // 平均仓位
//         averagePosition: '75',
//         // 盈利清单
//         profitList: {
//           // 总盈利
//           total: '98456888.68',
//           // 持仓股数
//           positionStockNumber: '4',
//           // 胜率
//           winRate: '57.14',
//           // 盈利持仓列表
//           positionStockList: [
//             {
//               // 产品代码
//               code: '600061',
//               // 产品名称
//               name: '中航重机',
//               // 产品标签
//               labels: '0',
//               // 产品内码
//               secuIntl: '000000',
//               // 产品盈亏金额
//               profitOrLossAmount: '75456888.24',
//             },
//             {
//               // 产品代码
//               code: '002230',
//               // 产品名称
//               name: '东湖高新',
//               // 产品标签
//               labels: '1',
//               // 产品内码
//               secuIntl: '000000',
//               // 产品盈亏金额
//               profitOrLossAmount: '65456888.24',
//             },
//             {
//               // 产品代码
//               code: '002550',
//               // 产品名称
//               name: '创业软件',
//               // 产品标签
//               labels: '2',
//               // 产品内码
//               secuIntl: '000000',
//               // 产品盈亏金额
//               profitOrLossAmount: '35999.24',
//             },
//             {
//               // 产品代码
//               code: '000001',
//               // 产品名称
//               name: '平安银行',
//               // 产品标签
//               labels: '',
//               // 产品内码
//               secuIntl: '000000',
//               // 产品盈亏金额
//               profitOrLossAmount: '4456.22',
//             },
//           ],
//         },
//         // 亏损清单
//         lossList: {
//           // 总亏损
//           total: '-9800.28',
//           // 持仓股数
//           positionStockNumber: '3',
//           // 胜率 (亏损无胜率)
//           // winRate: '',
//           // 持仓列表
//           positionStockList: [
//             {
//               // 产品代码
//               code: '600061',
//               // 产品名称
//               name: '川恒股份',
//               // 产品标签
//               labels: '3',
//               // 产品内码
//               secuIntl: '000000',
//               // 产品盈亏金额
//               profitOrLossAmount: '-6793.68',
//             },
//             {
//               // 产品代码
//               code: '002230',
//               // 产品名称
//               name: '科大讯飞',
//               // 产品标签
//               labels: '4',
//               // 产品内码
//               secuIntl: '000000',
//               // 产品盈亏金额
//               profitOrLossAmount: '-3573.34',
//             },
//             {
//               // 产品代码
//               code: '002550',
//               // 产品名称
//               name: '千红制药',
//               // 产品标签
//               labels: '',
//               // 产品内码
//               secuIntl: '000000',
//               // 产品盈亏金额
//               profitOrLossAmount: '-873.34',
//             },
//           ],
//         },
//       },
//       // 持仓理财分析
//       financialPositionAnalysis: {
//         // 基金区间持仓总数
//         totalFundRangePosition: '10',
//         // 基金区间收益
//         fundRangeIncome: '-109.87',
//         // 基金期末市值
//         fundEndingMarketValue: '234523.23',
//         // 基金持仓列表
//         fundPositionList: [
//           {
//             // 产品代码
//             code: '600061',
//             // 产品名称
//             name: '兴全趋势(LOF)',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002550',
//             // 产品名称
//             name: '易方达消费行业股票',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '873.34',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '600061',
//             // 产品名称
//             name: '中欧新蓝筹混合A',
//             // 清仓标志
//             hasSoldOut: '0',
//             // 收益
//             income: '-6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002230',
//             // 产品名称
//             name: '鹏华沪深300指数',
//             // 清仓标志
//             hasSoldOut: '0',
//             // 收益
//             income: '3753.33',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002230',
//             // 产品名称
//             name: '天弘沪深300指数A',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '-8955.33',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '600061',
//             // 产品名称
//             name: '民生加银家盈理财7天债券A',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '600071',
//             // 产品名称
//             name: '广发理财30天',
//             // 清仓标志
//             hasSoldOut: '0',
//             // 收益
//             income: '-6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '600061',
//             // 产品名称
//             name: '兴全趋势(LOF)',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002550',
//             // 产品名称
//             name: '易方达消费行业股票',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '873.34',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '600061',
//             // 产品名称
//             name: '中欧新蓝筹混合A',
//             // 清仓标志
//             hasSoldOut: '0',
//             // 收益
//             income: '-6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002230',
//             // 产品名称
//             name: '鹏华沪深300指数',
//             // 清仓标志
//             hasSoldOut: '0',
//             // 收益
//             income: '3753.33',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002230',
//             // 产品名称
//             name: '天弘沪深300指数A',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '-8955.33',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '600061',
//             // 产品名称
//             name: '民生加银家盈理财7天债券A',
//             // 清仓标志
//             hasSoldOut: '1',
//             // 收益
//             income: '6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '600071',
//             // 产品名称
//             name: '广发理财30天',
//             // 清仓标志
//             hasSoldOut: '0',
//             // 收益
//             income: '-6793.68',
//             // 产品内码
//             secuIntl: '000000',
//           },
//         ],
//         lcPosiNum: '10',
//         lcFinalPlAmt: '892.43',
//         lcFinaMktVal: '34523.54',
//         lcPosiList: [
//           {
//             // 产品代码
//             code: '002255',
//             // 产品名称
//             name: '新手理财001',
//             // 产品收益
//             income: '7999.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '001155',
//             // 产品名称
//             name: '万利宝18年26期C款',
//             // 产品收益
//             income: '-7999.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002355',
//             // 产品名称
//             name: '安信理财1号',
//             // 产品收益
//             income: '799.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002655',
//             // 产品名称
//             name: '安信尊享价值',
//             // 产品收益
//             income: '-79.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002255',
//             // 产品名称
//             name: '新手理财001',
//             // 产品收益
//             income: '7999.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '001155',
//             // 产品名称
//             name: '万利宝18年26期C款',
//             // 产品收益
//             income: '-7999.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002355',
//             // 产品名称
//             name: '安信理财1号',
//             // 产品收益
//             income: '799.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//           {
//             // 产品代码
//             code: '002655',
//             // 产品名称
//             name: '安信尊享价值',
//             // 产品收益
//             income: '-79.05',
//             // 产品内码
//             secuIntl: '000000',
//           },
//         ],
//       },
//     },
//     state: 200,
//   },
// };