// export default {
//   'POST /api/diagnose/v1/findstocks': {
//     code: 1,
//     records: {
//       // 持仓总数
//       holdNumber: '7',
//       // 平均仓位
//       averagePosition: '75',
//       // 盈利清单
//       profitList: {
//         // 总盈利
//         total: '98456888.68',
//         // 持仓股数
//         positionStockNumber: '4',
//         // 胜率
//         winRate: '57.14',
//         // 盈利持仓列表
//         positionStockList: [{
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '中航重机',
//           // 产品标签
//           labels: '0',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '75456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },

//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '东湖高新',
//           // 产品标签
//           labels: '1',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '65456888.24',
//         },
//         {
//           // 产品代码
//           code: '002550',
//           // 产品名称
//           name: '创业软件',
//           // 产品标签
//           labels: '2',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '35999.24',
//         },
//         {
//           // 产品代码
//           code: '000001',
//           // 产品名称
//           name: '平安银行',
//           // 产品标签
//           labels: '',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '4456.22',
//         },
//         ],
//       },
//       // 亏损清单
//       lossList: {
//         // 总亏损
//         total: '-9800.28',
//         // 持仓股数
//         positionStockNumber: '3',
//         // 胜率 (亏损无胜率)
//         // winRate: '',
//         // 持仓列表
//         positionStockList: [{
//           // 产品代码
//           code: '600061',
//           // 产品名称
//           name: '川恒股份',
//           // 产品标签
//           labels: '3',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '-6793.68',
//         },
//         {
//           // 产品代码
//           code: '002230',
//           // 产品名称
//           name: '科大讯飞',
//           // 产品标签
//           labels: '4',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '-3573.34',
//         },
//         {
//           // 产品代码
//           code: '002550',
//           // 产品名称
//           name: '千红制药',
//           // 产品标签
//           labels: '',
//           // 产品内码
//           secuIntl: '000000',
//           // 产品盈亏金额
//           profitOrLossAmount: '-873.34',
//         },
//         ],
//       },
//     },
//     state: 200,
//   },
// };